#lang racket

; За всяка от задачите, ако е възможно, напишете по два варианта:
; чрез примитивна и чрез опашкова рекурсия.

; 01. Да се дефинира функция, която намира броя цифри в число.
; Пример: (digit-count 1230) ~> 4
(define (digit-count x) 'undefined)

; 02. Да се дефинира функция, която обръща цифрите на число.
; Пример: (reverse-digits 123) ~> 321
(define (reverse-digits x) 'undefined)

; 03. Да се дефинира функция, която намира най-голямото число k,
; така че квадратът му да е по-малък от подадено число x.
; Пример: (integer-square-root 27) ~> 5
(define (integer-square-root x) 'undefined)

; 04. Да се дефинира функция, която проверява дали цяло число е
; число на Армстронг. Казваме, че едно число е число на Армстронг,
; ако сумата от кубовете на цифрите на числото е равна на самото число.
; Пример: (armstrong? 153) ~> #t
(define (armstrong? x) 'undefined)

; 05. Да се дефинира функция, която намира сумата
; на всички делители на естествено число.
; Пример: (divisor-sum 8) ~> 15
(define (divisor-sum x) 'undefined)

; 06. Да се дефинира функция, която намира най-голямата стойност, която
; се достига в редицата на Колац за дадено число x. Следващият член от
; редицата на Колац се получава на всяка стъпка по следния начин:
; - ако x е четно, то следващият член е x / 2;
; - ако x е нечетно, то следващият член е x * 3 + 1.
; Редицата завършва, когато се достигне 1.
; Пример: (hailstone-max 6) ~> 16
(define (hailstone-max x) 'undefined)

; 07. Да се дефинира функция, която приема две бройни системи,
; from и to, и цяло число x и преобразува числото x в бройна система
; с основа from в число в бройна система с основа to.
; Пример: (transform 2 16 1100) ~> 12
(define (transform from to x) 'undefined)

; 08. Да се дефинира функция, която приема основа x и степен n
; и повдига x на съотвената степен n. Да не се използват вградени функции.
(define (pow x n) 'undefined)

; 09. Да се дефинира функция, която реализира алгоритъма за бързо степенуване.
; Имплементирайте функцията само чрез опашкова рекурсия.
(define (quick-pow x n) 'undefined)

; 10. Да се дефинира функция, която сортира цифрите на цяло число в нарастващ ред.
; Пример: (sort-digits 4215) ~> 1245
(define (sort-digits x) 'undefined)
