; това е тук, за да се укаже какъв диалект се използва
; (в DrRacket може да се конфигурира през UI-а и да не се пише всеки път)
#lang racket ; #lang r5rs

; Scheme е функционален език за програмиране, диалект на LISP
; Има различни стандарти на езика, като ние ще използваме R5RS

; Има следните характеристики:
; - сравнително прост синтаксис
; - стриктен (eager)
; - динамично типизиран (dynamically typed)
; - нечист (impure)

; Файловите разширения са обикновено .scm (Scheme) или .rkt (Racket)

; Всеки израз в Scheme представлява т.нар. S-израз:
; - ако c е някаква константа, напр. 42, #t, "abcd" и др., то c е S-израз;
; - ако x е някакъв символ, свързан със стойност, x е S-израз;
; - ако s1 и s2 са S-изрази, то (s1 . s2) е S-израз.

;====================================================================

; Базов синтаксис

; литерали - 5, #f, #t, "xyz", #\a
#\x
42
#f

; символи - a, b, 1+, some-symbol

; комбинации - (s1 s2 ... sn)
(+ 2 3)

; вградени функции и оператори:
; +, -, *, /, quoetient, remainder, sqrt, expt
; number?, integer?, real?, boolean?, procedure?, symbol?

; дефиниции на символи:

(define a 15)

(define 1+2 (+ 1 2))

(define true #t)
(define false #f)

(define str "abd")

; дефиниции на функции (отново са дефиниции на символи,
; като тук всеки символ е свързан с функция)

(define (1+ x) (+ x 1))

(define (2+) (lambda (x) (+ x 2)))

(define (3+) (λ (x) (+ x 3)))

; въпрос: каква е разликата между символите a и b?
(define (b) 15)

;====================================================================

; Правила за оценяване:

; - литералите се оценяват до себе си;
; - символите се оценяват до стойността, с която са свързани.

; Ако имаме комбинация от вида (f x1 ... xn):
; - всеки израз f, x1, ..., xn се оценява ОТДЕЛНО;
; - ако f е n-местна функция, то резултатът от комбинацията
;   е резултатър от прилагането на f върху x1, ..., xn;
; - при неуспешна оценка на някой от изразите се хвърля грешка.


; Някои основни грешки и какво могат да означават в горния контекст:

; 1. f: arity mismatch; the expected number of arguments does not match the given number
; >>> подали сме неправилен брой аргументи на функцията f

; Пример: (1+ 2 3)

; 2. application: not a procedure; expected a procedure that can be applied to arguments
; >>> първият израз в комбинация не е функция (в Scheme се наричат процедури)

; Пример: (5 6 7)

; 3. +: contract violation; expected: number?; given: "a"
; >>> подали сме стойност от неправилен тип на някой параметър

; Пример: (1+ "a")


;====================================================================

; Специални форми - изрази, които не се оценяват по основното правило (по-горе)

; define
; if
; cond
; case
; and
; or
; define-syntax
; syntax-rules
; и др.

(define (even? n) (= (remainder n 2) 0))

(define (min a b) (if (< a b) a b))

; квадратните скоби не работят в r5rs! там всичките са кръгли :(
(define (grade score)
  (cond [(>= score 180) 6]
        [(>= score 160) 5]
        [(>= score 140) 4]
        [(>= score 120) 3]
        [else 2]))

(define (season-from-month month)
  (case month
    [(12 1 2) "winter"]
    [(3 4 5) "spring"]
    [(6 7 8) "summer"]
    [(9 10 11) "autumn"]
    [else 'invalid-month]))

(define (max a b)
  (or (and (> a b) a) b))
