#lang r5rs

; 01.
; Да се преведат следните изрази в префиксна нотация:

; 42 * 5 + 10 + 3

; 10^3 + (5 * 8 + 2)^14 % 9

; ((2^((3 + 1) * 2) + (7 * (5 - 2))^2) % ((4 + 3) * 2))

; 02
; Какви ще бъдат резултатите от оценките на следните изрази?

; (- (+ 10 9) (* (+ 3 1) (/ 1 2)))

; (- 1 2 3)

; (/ 2 3)
; (/ 2.0 3)

; -
; +

; (-)
; (+)

; (max -1 3)
; (min)
; (min 1 4 5 -inf.0 -100000000000000)

; (if 0 'true 'false)

; (and #f "foo")
; (or #f "bar")
; (or)

; разглеждайте ги като едно цяло
; (define a 5)
; (define a a)

; 03
; Да се дефинира функция, която приема естествено число
; и връща двоен факториел от него.

; Пример: (double-fact 6) ~> 
(define (double-fact n) 'undefined)

; 04
; Да се дефинира функция, която намира n-тото число на Фибоначи.

; Пример: (fib 10) ~> 55
(define (fib n) 'undefined)

; 05
; Да се дефинира функция, която приема две числа a и b
; И намира сумата на числата в интервала [a,b].

; Пример: (sum-interval 0 11) ~> 66
(define (sum-interval a b) 'undefined)

; 06
; Да се дефинира функция, която намира най-големия общ делител на две числа.

; Пример: (gcd 12 8) ~> 4
(define (gcd a b) 'undefined)

; 07
; Да се дефинира функция, която намира най-малкото общо кратно на две числа.

; Пример: (lcm 12 8) ~> 24
(define (lcm a b) 'undefined)

; 08
; Да се дефинира функция, която обръща цифрите на цяло число.

; Пример: (reverse-digits 1230) ~> 321
(define (reverse-digits n) 'undefined)

; 09
; Да се дефинира функция, която проверява дали числото n
; е палиндром в бройната система с основа base.

; Пример: (palindrome-in-base? 2 3) ~> #t
;         (palindrome-in-base? 2 4) ~> #f
(define (palindrome-in-base? base n) 'undefined)

; 10
; Да се дефинира функция, която намира сумата от цифрите на цяло число.

; Пример: (sum-digits 12345) ~> 15
(define (sum-digits n) 'undefined)

; 11
; Да се дефинира функция, която приема цяло число и събира неговите цифри,
; докато резултатът не стане едноцифрено число.

; Пример: (digital-root 9992) ~> 2
; Обяснение: Събираме цифрите на 9992 и получаваме 29.
; Събираме цифрите на 29 и получаваме 11.
; Събираме цифрите на 11 и получаваме 2.
(define (digital-root n) 'undefined)

; 12
; Да се дефинира функция, която приема цяло число
; и проверява дали то е автоморфно. Казваме, че едно число
; е автоморфно, ако квадратът му завършва на самото число.

; Пример: (automorphic? 25) ~> #t
(define (automorphic? n) 'undefined)
