#lang racket

; Ще дефинираме няколко функции за удобство:

(define (1+ x) (+ x 1))
(define (3* x) (* x 3))

; Функциите от по-висок ред са функции,
; които приемат други функции като аргументи
; или връщат такива. Полезни са ни, за да можем
; да абстрахираме функциите не само по някакви стойности,
; но и по "действия".

; Стандартен пример за функция от по-висок ред
; е композицията на две функции - от една страна,
; приема две функции като аргументи, а от друга -
; връща функция като резултат:

(define (compose* f g x) (f (g x)))

(compose* 1+ 3* 2)
(compose* 3* 1+ 2)

; Забележете, че горе не връщаме функция,
; а директно - резултат! Затова се налага
; при извикването на compose* да подаваме
; и аргумента, върху който прилагаме функциите.
; По-надолу ще видим как можем да дефинираме
; "истинска" композиция и да върнем функция.

; Ламбда-функциите (или анонимни функции) са функции,
; които нямат имена. Използваме ги основно ако не искаме
; да създаваме отделна именована функция, която да
; подадем на друга функция от по-висок ред.

(lambda (x) (+ x 1))
(λ (x) (+ x 1))

; в DrRacket може да въведете символа за λ
; директно с ctrl + \

; Допълнително, всички дефиниции на функции,
; които сме разглеждали досега, реално са просто
; дефиниции на символи, които се свързват с някаква
; ламбда-функция.

; Тоест, това е синтактична захар

(define (some-function x y) (+ x (* x y)))

; и е просто (с друго име, защото иначе е грешка)

(define some-function-λ (lambda (x y) (+ x (* x y))))

; Благодарение на ламбда-функциите можем да върнем
; и функция при дефиницията на композиция:

(define (compose f g)
  (lambda (x) (f (g x))))

; Горното е просто синтактична захар за:

(define compose-λ
  (lambda (f g)
    (lambda (x) (f (g x)))))

; Забележете, че извикването на compose
; е по-различно от това на compose*:

(compose* 1+ 3* 2)
((compose 1+ 3*) 2)

; Ще дефинираме следната функция, която проверява
; дали даден предикат p? е изпълнен за всеки елемент в интервал:

(define (forall? p? a b)
  (if (> a b)
      #t
      (and (p? a) (forall? p? (+ a 1) b))))

; Тогава какво можем да подаваме на p??
; Очевидно горе казахме, че това ще е някакъв предикат,
; в случая - едноместен. Тоест, очакваме на p? да се подаде
; едноместна функция.

; Нека разгледаме какви функции можем да подаваме.

(define (even? x) (= (remainder x 2) 0))
(define odd? (λ (x) (not (even? x))))

; Коя от двете функции можем да подадем на forall?

(forall? even? 1 10)
(forall? odd? 1 10)

; Отговорът е, че можем да подадем и двете функции.
; Все пак казахме, че синтаксисът (define (even? x) ...)
; се свежда просто до (define even? (λ (x) ...)),
; т.е. самият символ even? е свързан с едноместна функция
; и можем да го подадем.

; Нека разгледаме друга функция:

(define (reduce-interval op nv a b)
  (if (> a b)
      nv
      (op a (reduce-interval op nv (+ a 1) b))))

; която просто редуцира елементите в интервал.
; Например:

(reduce-interval + 0 1 10)

; намира сумата на целите числа в интервала [1;10].

; С цел по-добра илюстрация на горния пример,
; ще си дефинираме своя функция за събиране:

(define (add a b) (+ a b))

; Очевидно горното е еквивалентно на
; (define add (λ (a b) (+ a b))).
; Тоест, add е символ, свръзан с двуместна функция.
; Можем да я подадем на reduce-interval, защото
; той очаква именно такава функция.

; Забележка: + е вариадична функция, т.е.
; може да приема различен брой аргументи,
; в случая нула или повече.
; В частност може да приеме и два аргумента.

; Нека отново се върнем на forall? и дефинираме
; следния предикат:

(define (gt y x) (> x y))

; Тогава можем ли да направим следното:

(forall? (gt 5) 1 10)

; за да проверим дали всички числа в интервала са
; по-големи от 5?

; Очевидно горната дефиниция е еквивалентна на
; (define gt (λ (y x) (> x y))), което е двуместна функция.
; Но знаем, че forall? очаква едноместна такава.
; Тогава получаваме грешка:
; gt: arity mismatch;
;  the expected number of arguments does not match the given number
;   expected: 2
;   given: 1

; Затова трябва да внимаваме функции с каква арност подаваме
; на други функции от по-висок ред. В езици като Haskell
; горното би било възможно заради свойство, наречено currying.
; По подразбиране няма currying в Scheme/Racket.
