#lang racket

; Някои задачи умишлено нямат примери и "дефиниции" :)

; Някои от задачите дават по 2.5 точки, други по - 5, трети - по 0.
; Максимално в едно упражнение може да получите до 5 точки.


; Някои функции за удобство
(define (1+ x) (+ x 1))
(define (neg x) (- x))
(define (id x) x)
(define (const x) (λ (y) x))
(define (const* x) (λ (y) y))
(define (even x) (= (remainder x 2) 0))
(define (odd x) (not (even x)))

; 01. Да се дефинира функция, която приема функция и някакъв аргумент
; и връща резултата от двукратното прилагане на функцията.

; Пример: (apply-twice 1+ 2) ~> 4
(define (apply-twice f x) 'undefined)

; 02. Да се дефинира функция, която приема естествено число n,
; функция и някакъв аргумент и връща резултата от n-кратното
; прилагане на функцията.

; Пример: (apply-n 4 1+ 2) ~> 6
(define (apply-n n f x) 'undefined)

; 03. Да се дефинира функция, която приема естествено число n
; и функция и връща n-кратното прилагане на функцията.
; С какво се различава тази функция от горната?

; 04. Да се дефинира функция, която приема две функции и връща
; тяхната композиция.

; 05. Да се дефинира функция, която приема двуместна функция
; и обръща реда на аргументите, върху които се прилага функцията.

; Пример: ((flip -) 1 2) ~> 1
(define (flip f) 'undefined)

; 06. Да се дефинира функция, която приема двуместна функция f
; и връща последователност от две едноместни функции,
; като крайният резултат е самото прилагане на f върху аргументите.

; Пример: (((curry-2 +) 1) 2) ~> 3
(define (curry-2 f) 'undefined)

; Бонус: Да се дефинира функция, аналогична на горната,
; но да работи за n-местни функции, където n е произволно.
; Сещате ли се за вграден предикат, който може да ви помогне?

; 07. Да се дефинира функцията accumulate, показвана на лекции.
(define (accumulate op nv a b term next) 'undefined)

; Следващите задачи да се решат, използвайки accumulate.

; 08. Да се дефинира функция, която намира сумата на числата в
; някакъв интервал [a;b] и някаква стъпка step.

; Пример: (sum-interval-with-step 0.5 1 2) ~> 4.5
; Обяснение: Числата, които попадат в сумата, са 1, 1.5 и 2.

; 09. Да се дефинира функция, която повдига някакво число x
; на степен n.

; Пример: (pow 2 5) ~> 32
(define (pow base exp) 'undefined)

; 10. Да се дефинира функция, която намира броя на всички
; естествени делители на естествено число.

; Пример: (count-divisors 12) ~> 6
; Обяснение: 12 се дели на 1, 2, 3, 4, 6, 12.

; 11. Да се дефинира функция, която приема предикат и проверява
; дали съществува x в интервала [a;b], за което p(x) е истина.

; Пример: (exists? even 1 3) ~> #t
; Обяснение: 2 е в интервала [1;3] и е четно.
(define (exists? p? a b) 'undefined)

; 12. Да се дефинира функция, която връща n-кратната композиция на функция.

; Пример: ((compose-n 5 1+) 0) ~> 5
(define (compose-n n f) 'undefined)

; 13. Да се дефинира функция, която намира броя неподвижни точки на функция
; f в интервала (a;b). Една точка x е неподвижна за функцията f, ако
; f(x) = x.

; Пример: (fixpoints id 1 10) ~> 10
; Обяснение: id(x) = x за всяко x.
(define (fixpoints f a b) 'undefined)

; 14. Да се дефинира функция, която проверява дали число е просто.

; Пример: (prime? 5) ~> #t
(define (prime? x) 'undefined)

; 15. Да се дефинира функция, която намира такова x в интервал
; от цели числа [a;b], че функционалната стойност f(x) е най-голяма.

; Пример: (argmax neg -3 1) ~> -3
; Обяснение: -(-3) = 3 и функцията достига най-голямата си стойност в -3.
(define (argmax f a b) 'undefined)
